<?php


namespace Windqyoung\Utils\Random;


use RuntimeException;


class Random
{

    private static $chineseDict;

    private function getChineseDict()
    {
        if (null === self::$chineseDict)
        {
            self::$chineseDict = include __DIR__ . '/chinese_dict.php';
        }

        return self::$chineseDict;
    }

    public function nextChineseName($len = 4)
    {
        $dict = $this->getChineseDict();
        $randKey = (array) array_rand($dict, $len);

        $ret = '';
        foreach ($randKey as $key)
        {
            $ret .= $dict[$key]['zi'];
        }

        return $ret;
    }

    private static $mobileSegment = [
        '134', '135', '136', '137', '138', '139', '150', '151', '152', '157', '130', '131', '132', '155', '186', '133', '153', '189',
    ];

    public function nextMobile()
    {
        $prefix = self::$mobileSegment[array_rand(self::$mobileSegment)];
        $middle = mt_rand(2000, 9000);
        $suffix = mt_rand(2000, 9000);

        return $prefix . $middle . $suffix;
    }

    private static $surname = [
        '赵', '钱', '孙', '李', '周', '吴', '郑', '王', '冯', '陈', '褚', '卫', '蒋', '沈', '韩', '杨',
        '朱', '秦', '尤', '许', '何', '吕', '施', '张', '孔', '曹', '严', '华', '金', '魏', '陶', '姜',
        '戚', '谢', '邹', '喻', '柏', '水', '窦', '章', '云', '苏', '潘', '葛', '奚', '范', '彭', '郎',
        '鲁', '韦', '昌', '马', '苗', '凤', '花', '方', '俞', '任', '袁', '柳', '酆', '鲍', '史', '唐',
        '费', '廉', '岑', '薛', '雷', '贺', '倪', '汤', '滕', '殷', '罗', '毕', '郝', '邬', '安', '常',
        '乐', '于', '时', '傅', '皮', '卞', '齐', '康', '伍', '余', '元', '卜', '顾', '孟', '平', '黄',
        '和', '穆', '萧', '尹', '姚', '邵', '湛', '汪', '祁', '毛', '禹', '狄', '米', '贝', '明', '臧',
        '计', '伏', '成', '戴', '谈', '宋', '茅', '庞', '熊', '纪', '舒', '屈', '项', '祝', '董', '梁',
        '杜', '阮', '蓝', '闵', '席', '季', '麻', '强', '贾', '路', '娄', '危', '江', '童', '颜', '郭',
        '梅', '盛', '林', '刁', '钟', '徐', '邱', '骆', '高', '夏', '蔡', '田', '樊', '胡', '凌', '霍',
        '虞', '万', '支', '柯', '咎', '管', '卢', '莫', '经', '房', '裘', '缪', '干', '解', '应', '宗',
        '宣', '丁', '贲', '邓', '郁', '单', '杭', '洪', '包', '诸', '左', '石', '崔', '吉', '钮', '龚',
        '程', '嵇', '邢', '滑', '裴', '陆', '荣', '翁', '荀', '羊', '於', '惠', '甄', '魏', '加', '封',
        '芮', '羿', '储', '靳', '汲', '邴', '糜', '松', '井', '段', '富', '巫', '乌', '焦', '巴', '弓',
        '牧', '隗', '山', '谷', '车', '侯', '宓', '蓬', '全', '郗', '班', '仰', '秋', '仲', '伊', '宫',
        '宁', '仇', '栾', '暴', '甘', '钭', '厉', '戎', '祖', '武', '符', '刘', '姜', '詹', '束', '龙',
        '叶', '幸', '司', '韶', '郜', '黎', '蓟', '薄', '印', '宿', '白', '怀', '蒲', '台', '从', '鄂',
        '索', '咸', '籍', '赖', '卓', '蔺', '屠', '蒙', '池', '乔', '阴', '郁', '胥', '能', '苍', '双',
        '闻', '莘', '党', '翟', '谭', '贡', '劳', '逄', '姬', '申', '扶', '堵', '冉', '宰', '郦', '雍',
        '却', '璩', '桑', '桂', '濮', '牛', '寿', '通', '边', '扈', '燕', '冀', '郏', '浦', '尚', '农',
        '温', '别', '庄', '晏', '柴', '瞿', '阎', '充', '慕', '连', '茹', '习', '宦', '艾', '鱼', '容',
        '向', '古', '易', '慎', '戈', '廖', '庚', '终', '暨', '居', '衡', '步', '都', '耿', '满', '弘',
        '匡', '国', '文', '寇', '广', '禄', '阙', '东', '殴', '殳', '沃', '利', '蔚', '越', '夔', '隆',
        '师', '巩', '厍', '聂', '晁', '勾', '敖', '融', '冷', '訾', '辛', '阚', '那', '简', '饶', '空',
        '曾', '毋', '沙', '乜', '养', '鞠', '须', '丰', '巢', '关', '蒯', '相', '查', '后', '江', '红',
        '游', '竺', '权', '逯', '盖', '益', '桓', '公', '万', '俟', '司', '马', '上', '官', '欧', '阳',
        '夏', '侯', '诸', '葛', '闻', '人', '东', '方', '赫', '连', '皇', '甫', '尉', '迟', '公', '羊',
        '澹', '台', '公', '冶', '宗', '政', '濮', '阳', '淳', '于', '仲', '孙', '太', '叔', '申', '屠',
    ];


    public function nextPersonName($secondLen = 0)
    {
        $surname = self::$surname[array_rand(self::$surname)];

        $secondLen = ($secondLen > 0 && $secondLen <= 3) ? $secondLen : mt_rand(1, 2);
        $secondName = $this->nextChineseName($secondLen);

        return $surname . $secondName;
    }

    private static $idCardRegions = [
        "北京市" => 110000,
        "市辖区" => 110100,
        "东城区" => 110101,
        "西城区" => 110102,
        "崇文区" => 110103,
        "宣武区" => 110104,
        "朝阳区" => 110105,
        "丰台区" => 110106,
        "石景山区" => 110107,
        "海淀区" => 110108,
        "门头沟区" => 110109,
        "房山区" => 110111,
        "通州区" => 110112,
        "顺义区" => 110113,
        "昌平区" => 110114,
        "大兴区" => 110115,
        "怀柔区" => 110116,
        "平谷区" => 110117,
        "县" => 110200,
        "密云县" => 110228,
        "延庆县" => 110229,
        "天津市" => 120000,
        "市辖区" => 120100,
        "和平区" => 120101,
        "河东区" => 120102,
        "河西区" => 120103,
        "南开区" => 120104,
        "河北区" => 120105,
        "红桥区" => 120106,
        "东丽区" => 120110,
        "西青区" => 120111,
        "津南区" => 120112,
        "北辰区" => 120113,
        "武清区" => 120114,
        "宝坻区" => 120115,
        "县" => 120200,
        "宁河县" => 120221,
        "静海县" => 120223,
        "蓟　县" => 120225,
        "河北省" => 130000,
        "石家庄市" => 130100,
        "市辖区" => 130101,
        "长安区" => 130102,
        "桥东区" => 130103,
        "桥西区" => 130104,
        "新华区" => 130105,
        "井陉矿区" => 130107,
        "裕华区" => 130108,
        "井陉县" => 130121,
        "正定县" => 130123,
        "栾城县" => 130124,
        "行唐县" => 130125,
        "灵寿县" => 130126,
        "高邑县" => 130127,
        "深泽县" => 130128,
        "赞皇县" => 130129,
        "无极县" => 130130,
        "平山县" => 130131,
        "元氏县" => 130132,
        "赵　县" => 130133,
        "辛集市" => 130181,
        "藁城市" => 130182,
        "晋州市" => 130183,
        "新乐市" => 130184,
        "鹿泉市" => 130185,
        "唐山市" => 130200,
        "市辖区" => 130201,
        "路南区" => 130202,
        "路北区" => 130203,
        "古冶区" => 130204,
        "开平区" => 130205,
        "丰南区" => 130207,
        "丰润区" => 130208,
        "滦　县" => 130223,
        "滦南县" => 130224,
        "乐亭县" => 130225,
        "迁西县" => 130227,
        "玉田县" => 130229,
        "唐海县" => 130230,
        "遵化市" => 130281,
        "迁安市" => 130283,
        "秦皇岛市" => 130300,
        "市辖区" => 130301,
        "海港区" => 130302,
        "山海关区" => 130303,
        "北戴河区" => 130304,
        "青龙满族自治县" => 130321,
        "昌黎县" => 130322,
        "抚宁县" => 130323,
        "卢龙县" => 130324,
        "邯郸市" => 130400,
        "市辖区" => 130401,
        "邯山区" => 130402,
        "丛台区" => 130403,
        "复兴区" => 130404,
        "峰峰矿区" => 130406,
        "邯郸县" => 130421,
        "临漳县" => 130423,
        "成安县" => 130424,
        "大名县" => 130425,
        "涉　县" => 130426,
        "磁　县" => 130427,
        "肥乡县" => 130428,
        "永年县" => 130429,
        "邱　县" => 130430,
        "鸡泽县" => 130431,
        "广平县" => 130432,
        "馆陶县" => 130433,
        "魏　县" => 130434,
        "曲周县" => 130435,
        "武安市" => 130481,
        "邢台市" => 130500,
        "市辖区" => 130501,
        "桥东区" => 130502,
        "桥西区" => 130503,
        "邢台县" => 130521,
        "临城县" => 130522,
        "内丘县" => 130523,
        "柏乡县" => 130524,
        "隆尧县" => 130525,
        "任　县" => 130526,
        "南和县" => 130527,
        "宁晋县" => 130528,
        "巨鹿县" => 130529,
        "新河县" => 130530,
        "广宗县" => 130531,
        "平乡县" => 130532,
        "威　县" => 130533,
        "清河县" => 130534,
        "临西县" => 130535,
        "南宫市" => 130581,
        "沙河市" => 130582,
        "保定市" => 130600,
        "市辖区" => 130601,
        "新市区" => 130602,
        "北市区" => 130603,
        "南市区" => 130604,
        "满城县" => 130621,
        "清苑县" => 130622,
        "涞水县" => 130623,
        "阜平县" => 130624,
        "徐水县" => 130625,
        "定兴县" => 130626,
        "唐　县" => 130627,
        "高阳县" => 130628,
        "容城县" => 130629,
        "涞源县" => 130630,
        "望都县" => 130631,
        "安新县" => 130632,
        "易　县" => 130633,
        "曲阳县" => 130634,
        "蠡　县" => 130635,
        "顺平县" => 130636,
        "博野县" => 130637,
        "雄　县" => 130638,
        "涿州市" => 130681,
        "定州市" => 130682,
        "安国市" => 130683,
        "高碑店市" => 130684,
        "张家口市" => 130700,
        "市辖区" => 130701,
        "桥东区" => 130702,
        "桥西区" => 130703,
        "宣化区" => 130705,
        "下花园区" => 130706,
        "宣化县" => 130721,
        "张北县" => 130722,
        "康保县" => 130723,
        "沽源县" => 130724,
        "尚义县" => 130725,
        "蔚　县" => 130726,
        "阳原县" => 130727,
        "怀安县" => 130728,
        "万全县" => 130729,
        "怀来县" => 130730,
        "涿鹿县" => 130731,
        "赤城县" => 130732,
        "崇礼县" => 130733,
        "承德市" => 130800,
        "市辖区" => 130801,
        "双桥区" => 130802,
        "双滦区" => 130803,
        "鹰手营子矿区" => 130804,
        "承德县" => 130821,
        "兴隆县" => 130822,
        "平泉县" => 130823,
        "滦平县" => 130824,
        "隆化县" => 130825,
        "丰宁满族自治县" => 130826,
        "宽城满族自治县" => 130827,
        "围场满族蒙古族自治县" => 130828,
        "沧州市" => 130900,
        "市辖区" => 130901,
        "新华区" => 130902,
        "运河区" => 130903,
        "沧　县" => 130921,
        "青　县" => 130922,
        "东光县" => 130923,
        "海兴县" => 130924,
        "盐山县" => 130925,
        "肃宁县" => 130926,
        "南皮县" => 130927,
        "吴桥县" => 130928,
        "献　县" => 130929,
        "孟村回族自治县" => 130930,
        "泊头市" => 130981,
        "任丘市" => 130982,
        "黄骅市" => 130983,
        "河间市" => 130984,
        "廊坊市" => 131000,
        "市辖区" => 131001,
        "安次区" => 131002,
        "广阳区" => 131003,
        "固安县" => 131022,
        "永清县" => 131023,
        "香河县" => 131024,
        "大城县" => 131025,
        "文安县" => 131026,
        "大厂回族自治县" => 131028,
        "霸州市" => 131081,
        "三河市" => 131082,
        "衡水市" => 131100,
        "市辖区" => 131101,
        "桃城区" => 131102,
        "枣强县" => 131121,
        "武邑县" => 131122,
        "武强县" => 131123,
        "饶阳县" => 131124,
        "安平县" => 131125,
        "故城县" => 131126,
        "景　县" => 131127,
        "阜城县" => 131128,
        "冀州市" => 131181,
        "深州市" => 131182,
        "山西省" => 140000,
        "太原市" => 140100,
        "市辖区" => 140101,
        "小店区" => 140105,
        "迎泽区" => 140106,
    ];

    public function nextIdCard()
    {
        $prefix = self::$idCardRegions[array_rand(self::$idCardRegions)];
        $date = date('Ymd', mt_rand(0, 1262275200));
        $pre17 = sprintf('%6d%8d%03d', $prefix, $date, mt_rand(1, 999));

        return $pre17 . $this->signIdCard($pre17);
    }

    private function signIdCard($pre17)
    {
        $weightArray = [7, 9, 10, 5, 8, 4, 2, 1, 6, 3, 7, 9, 10, 5, 8, 4, 2];

        $sum = 0;
        foreach ($weightArray as $key => $w)
        {
            $sum += $w * $pre17[$key];
        }

        $mod11 = $sum % 11;
        $map = ['1', '0', 'X', '9', '8', '7', '6', '5', '4', '3', '2'];

        return $map[$mod11];
    }


    public function nextString($length = 16)
    {
        $string = '';

        while (($len = strlen($string)) < $length) {
            $size = $length - $len;

            $bytes = $this->randomBytes($size);

            $string .= substr(str_replace(['/', '+', '='], '', base64_encode($bytes)), 0, $size);
        }

        return $string;
    }

    public function randomBytes($length = 16)
    {
        if (PHP_MAJOR_VERSION >= 7) {
            $bytes = random_bytes($length);
        } elseif (function_exists('openssl_random_pseudo_bytes')) {
            $bytes = openssl_random_pseudo_bytes($length, $strong);

            if ($bytes === false || $strong === false) {
                throw new RuntimeException('Unable to generate random string.');
            }
        } else {
            throw new RuntimeException('OpenSSL extension is required for PHP 5 users.');
        }

        return $bytes;
    }

}